Repository: radnive/Flutter_WeatherApp
Catalog: lib/l10n/intl_*.arb
Languages: fa

# locale
source: en
fa: fa

# introPageText
source: Let's Find Your Place!
fa: مکانتو باید اضافه کنی، بزن بریم!

# introPageGetStartedButtonText
source: Get Started
fa: شروع کنیم

# requestsNumberErrorMessageTitle
source: The server does not response!
fa: سرور پاسخ نمیدهد!

# requestsNumberErrorMessageSubtitle
source: The number of requests exceeded.
fa: تعداد درخواست ها بیش از حد مجاز شده است.

# noInternetErrorMessageTitle
source: No internet connection!
fa: اتصال به اینترنت برقرار نیست!

# noInternetErrorMessageSubtitle
source: Please check your internet connection.
fa: لطفا وضعیت اینترنت خود را بررسی کنید.

# confirmMessageTitle
source: Are you sure?
fa: آیا مطمئن هستید؟

# confirmMessageSubtitle
source: If you are not sure, swipe to the right.
fa: اگر اطمینان ندارید، به سمت راست بکشید.

# confirmExitMessageTitle
source: Do you want to close the app?
fa: آیا میخواهید از برنامه خارج شوید؟

# confirmExitMessageSubtitle
source: If you don't want it, swipe to the right.
fa: اگر این را نمی خواهید، به سمت راست بکشید.

# somethingWentWrongTitle
source: Something went wrong!
fa: مشکلی پیش آمده است!

# somethingWentWrongSubtitle
source: We can't connect to server.
fa: در حال حاضر ارتباط با سرور انجام نمی شود.

# emptySearchBoxErrorMessageTitle
source: You missed something!
fa: یک مورد چیزی را فراموش کردید!

# emptySearchBoxErrorMessageSubtitle
source: The location text field can't be empty.
fa: فیلد نام مکان نمی تواند خالی باشد.

# unableToAddLocationErrorMessage
source: Unable to add "{name}"
fa: نمی توان "{name}" را اضافه کرد.

# openWebpageErrorTitleMessage
source: Unable to open web page!
fa: امکان باز کردن وبسایت وجود ندارد!

# openWebpageErrorSubtitleMessage
source: The web page is unavailable.
fa: وبسایت در دسترس نیست.

# refreshIndicatorPullDownMessage
source: Pull down to update data.
fa: برای بروزرسانی به سمت پایین بکشید.

# refreshIndicatorReleaseMessage
source: Release to load data.
fa: برای بارگیری اطلاعات رها کنید.

# refreshIndicatorLoadDataMessage
source: Loading data from server...
fa: در حال بارگیری اطلاعات از سرور...

# refreshIndicatorSuccessMessage
source: Data successfully updated.
fa: اطلاعات با موفقیت به روز شد.

# refreshIndicatorNoResponseMessage
source: The number of requests exceeded.
fa: تعداد درخواست ها بیش از حد مجاز.

# refreshIndicatorErrorMessage
source: We can't get data from server!
fa: امکان دریافت اطلاعات از سرور وجود ندارد!

# unavailableText
source: Unavailable
fa: خارج از دسترس

# windTitle
source: WIND
fa: سرعت باد

# uvIndexTitle
source: UV INDEX
fa: میزان نور فرابنفش

# feelsLikeTitle
source: FEELS LIKE
fa: دما حسی

# humidityTitle
source: HUMIDITY
fa: رطوبت نسبی

# visibilityTitle
source: VISIBILITY
fa: میزان دید

# sunriseText
source: Sunrise
fa: طلوع

# sunsetText
source: Sunset
fa: غروب

# airQualityIndexTitle
source: Air Quality Index
fa: شاخص کیفیت هوا

# airQualityIndexSubtitle
source: {locationName} air quality is
fa: کیفیت هوای {locationName}

# aqiFakeDateTagText
source: Fake Data
fa: داده ها ساختگی است

# aqiScaleText
source: Excellent,Good,Fair,Poor,Unhealthy,Dangerous
fa: عالی,خوب,نسبتا سالم,بد,ناسالم,خطرناک

# tomorrowText
source: Tomorrow
fa: فردا

# next12DaysForecastButtonText
source: The Next 12 Days
fa: آب و هوای 12 روز آینده

# refreshIndicatorSwipeState
source: Swipe down to update data!
fa: برای بروزرسانی به سمت پائین بکشید!

# refreshIndicatorLoadingState
source: Loading data from server...
fa: در حال بارگذاری داده ها از سرور...

# refreshIndicatorSuccessfulState
source: Data updated successfully ;)
fa: داده ها با موفقیت بروز شد ;)

# refreshIndicatorErrorState
source: Oops, Something went wrong!
fa: مشکلی پیش آمده است!

# weekDays
source: Monday,Tuesday,Wednesday,Thursday,Friday,Saturday,Sunday
fa: دوشنبه,سه شنبه,چهارشنبه,پنجشنبه,جمعه,شنبه,یکشنبه

# months
source: January,February,March,April,May,June,July,August,September,October,November,December
fa: ژانویه,فوریه,مارس,آوریل,مه,ژوئن,جولای,آگوست,سپتامبر,اکتبر,نوامبر,دسامبر

# manageLocationsTitle
source: Manage Locations
fa: مدیریت مکان ها

# manageLocationsSubtitle
source: Add or remove Locations.
fa: حذف یا اضافه مکان ها

# popularLocationsTitle
source: Popular Locations
fa: مکان های پر بازدید

# searchLocationTextFieldHint
source: Enter location
fa: نام مکان را وارد کنید

# pinButtonText
source: Pin It
fa: سنجاق

# pinnedTagText
source: Pinned
fa: سنجاق شده

# yesButtonText
source: Yes
fa: بله

# deleteButtonText
source: Delete
fa: حذف

# addedButtonText
source: Added
fa: اضافه شده

# okayButtonText
source: Okay
fa: باشه

# retryButtonText
source: Retry
fa: تلاش مجدد

# locationNotFoundMessageTitle
source: Nothing Founded!
fa: چیزی پیدا نشد!

# locationNotFoundMessageSubtitle
source: There is no location with this name in the world.
fa: هیچ مکانی با این نام پیدا نشد.

# emptyListMessageTitle
source: The List Is Empty!
fa: لیست خالی است!

# emptyListMessageSubtitle
source: Let's add your favorite locations.
fa: بزن بریم مکان مورد علاقه ات رو اضافه کنیم.

# settingsTitle
source: Settings
fa: تنظیمات

# settingsSubtitle
source: Customize the app.
fa: شخصی سازی اپلیکیشن

# submitButtonText
source: Submit
fa: ثبت کن

# cancelButtonText
source: Cancel
fa: بی خیال!

# unitsSettingsTitle
source: UNITS
fa: واحد های اندازه گیری

# temperatureUnitItemText
source: Temperature units
fa: واحد دما

# windSpeedUnitItemText
source: Wind speed units
fa: واحد سرعت باد

# visibilityUnitItemText
source: Visibility units
fa: واحد میزان دید

# otherSettingsTitle
source: OTHER SETTINGS
fa: سایر تنظیمات

# languageItemText
source: Language
fa: زبان

# themeItemText
source: Theme
fa: ظاهر برنامه

# autoUpdateItemText
source: Automatic update
fa: بروزرسانی خودکار

# communicationSettingsTitle
source: COMMUNICATION
fa: راه های ارتباطی

# feedbackItemText
source: Feedback
fa: ثبت بازخورد

# contactMeItemText
source: Contact Me
fa: ارتباط با ما

# aboutTitle
source: ABOUT
fa: درباره برنامه

# appVersionItemText
source: App Version
fa: شماره نسخه برنامه

# developerItemText
source: Designed and developed by
fa: طراحی و توسعه یافته توسط

# weatherDataProviderItemText
source: Weather data provider
fa: فراهم آورنده داده های آب و هوا

# sunStatusDataProviderItemText
source: Sun status data provider
fa: فراهم آورنده داده های آفتاب

# privacyPolicyItemText
source: Privacy Policy
fa: سیاست حفظ حریم خصوصی

# temperatureUnitBottomSheetTitle
source: Select temperature unit
fa: واحد اندازه گیری دما را انتخاب کنید

# temperatureUnitChoiceSubtitles
source: Celsius,Fahrenheit
fa: سلسیوس,فارنهایت

# windSpeedUnitBottomSheetTitle
source: Select wind speed unit
fa: واحد اندازه گیری سرعت باد را انتخاب کنید

# windSpeedUnitChoiceSubtitles
source: Kilometer per hour,Miles per hour
fa: کیلومتر بر ساعت,مایل بر ساعت

# visibilityUnitBottomSheetTitle
source: Select visibility unit
fa: واحد اندازه گیری میزان دید را انتخاب کنید

# visibilityUnitChoiceSubtitles
source: Kilometer,Mile
fa: کیلومتر,مایل

# languageBottomSheetTitle
source: Select default language
fa: زبان اپلیکیشن را انتخاب کنید

# languagesChoiceTitles
source: Persian,English
fa: پارسی,انگلیسی

# languagesChoiceSubtitles
source: Iran,United State
fa: ایران,ایالات متحده

# themeBottomSheetTitle
source: Select app theme language
fa: ظاهر برنامه را انتخاب کنید

# themeChoiceTitles
source: Auto,Light,Dark
fa: خودکار,روشن,تاریک

# themeChoiceSubtitles
source: Device theme,White theme,Black Theme
fa: ظاهر دستگاه,ظاهر سفید,ظاهر مشکی

# feedbackBottomSheetTitle
source: How do you feel about Weather App?
fa: احساس شما نسبت به این اپلیکیشن چیست؟

# contactMeBottomSheetTitle
source: How do you want to contact me?
fa: از چه راهی میخواهید با من ارتباط بگیرید؟

# contactMeChoiceSubtitles
source: Instagram,Github,Dribbble
fa: اینستاگرام,گیت هاب,دریبل
